데이터를 합치는 또 다른 방법으로는 이어붙이기(concatenation), 연결(binding), 적층(stacking) 등이 있는데, <br/>
numpy는 ndarray를 연결하는 concatenate 함수를 제공한다.

In [3]:
import numpy as np
import pandas as pd

In [8]:
arr = np.arange(12).reshape(3,4)

In [9]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [12]:
np.concatenate([arr,arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

Serise나 DataFrame 같은 pandas 객체의 컨텍스트 내부에는 축마다 이름이 있어서 배열을 쉽게 이어붙일 수 있도록 되어 있다.<br/>
특히 다음 사항을 고려해야 한다.
- 만약 연결하려는 두 객체의 색인이 서로 다르다면 결과는 그 색인의 교집합이어야 하는가 아미년 합집합이어야 하는가
- 합쳐진 결과에서 합쳐지기 전 갹체의 데이터를 구분할 수 있는가
- 어떤 축으로 연결할 것인지 고려해야 하는가<br/>
#### pandas의 `concat`함수는 이 사항에 대한 해답을 제공한다.

In [13]:
s1 = pd.Series([0,1], index=['a','b'])
s2 = pd.Series([2,3,4], index=['c','d','e'])
s3 = pd.Series([5,6], index=['f','g'])

In [14]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

`concat` 함수는 `axis=0`을 기본 값으로 하고 새로운 Series 객체를 생성한다.<br/>
만약 `axis=1`을 넘긴다면 결과는 Series가 아니라 DataFrame 이 될 것이다.

In [15]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [17]:
s4 = pd.concat([s1*5,s3])

In [18]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [19]:
pd.concat([s1,s4],axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [20]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  5

In [23]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                  index=['a','b','c'],
                  columns=['one','two'])

In [24]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),
                  index=['a','c'],
                  columns=['three','four'])

In [25]:
pd.concat([df1,df2])

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

`keys`는 index 혹은 column 이름이 된다.

In [26]:
pd.concat([df1,df2], keys=['level1','level2'])

          four  one  three  two
level1 a   NaN  0.0    NaN  1.0
       b   NaN  2.0    NaN  3.0
       c   NaN  4.0    NaN  5.0
level2 a   6.0  NaN    5.0  NaN
       c   8.0  NaN    7.0  NaN

In [27]:
pd.concat([df1,df2],axis=1, keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [28]:
pd.concat({'level1':df1,'level2':df2})

          four  one  three  two
level1 a   NaN  0.0    NaN  1.0
       b   NaN  2.0    NaN  3.0
       c   NaN  4.0    NaN  5.0
level2 a   6.0  NaN    5.0  NaN
       c   8.0  NaN    7.0  NaN

색인이 불필요할 경우 `ignore_index=True`로 무시할 수 있다.

In [29]:
pd.concat([df1,df2])

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

In [30]:
pd.concat([df1,df2],ignore_index=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   6.0  NaN    5.0  NaN
4   8.0  NaN    7.0  NaN